{
	"FormatVersion": 2,
	"Namespace": "",
	"Children": [
		{
			"Source":
			{
				"Text": "/Game"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "B20E05B745D88701750101ABF817FAE4"
		},
		{
			"Source":
			{
				"Text": "Click execute to load excel to content"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "01049E4F480D90B1A3B062925AF98F9C"
		},
		{
			"Source":
			{
				"Text": "Curve Table Path In Content:"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "B3C4DFBD471EDCF6E95715B7E83906F1"
		},
		{
			"Source":
			{
				"Text": "Enter the directory under the game. eg. /Game/Folder/Content"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "B1E44574479A9FD333F4EF9A045FA01C"
		},
		{
			"Source":
			{
				"Text": "Execute"
			},
			"Translation":
			{
				"Text": "执行"
			},
			"Key": "2C5608A140603747C61F94B6FA0FD8C8"
		},
		{
			"Source":
			{
				"Text": "Input Excel Path In System:"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "BCDA44EF45BAD4F96BE102AFCB7A110C"
		},
		{
			"Source":
			{
				"Text": "Input the absolute directory of the excel file or click \"Search\" on the right to choose."
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "391CBD0D43FB6818A8D3D2A4E682FA0A"
		},
		{
			"Source":
			{
				"Text": "LoadCharacterAttribute"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "C5568BEB46CBB9F5694A02828BA61C12"
		},
		{
			"Source":
			{
				"Text": "Search"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "A08B2E1C45F60D3CD31852A3C76E66FB"
		},
		{
			"Source":
			{
				"Text": "TestLoad"
			},
			"Translation":
			{
				"Text": ""
			},
			"Key": "7690E08146646F810EA101B5010DAB50"
		}
	],
	"Subnamespaces": [
		{
			"Namespace": "CommonImporter",
			"Children": [
				{
					"Source":
					{
						"Text": "Curve table creation is failed."
					},
					"Translation":
					{
						"Text": "曲线表创建失败"
					},
					"Key": "CommonImporter.CurveTableCreateFailPrompt"
				},
				{
					"Source":
					{
						"Text": "Curve table is existed but failed to load."
					},
					"Translation":
					{
						"Text": "曲线表已经存在但加载失败"
					},
					"Key": "CommonImporter.LoadCurveTableFailed"
				},
				{
					"Source":
					{
						"Text": "No curve loaded."
					},
					"Translation":
					{
						"Text": "无曲线表加载"
					},
					"Key": "CommonImporter.NoCurveTablePrompt"
				},
				{
					"Source":
					{
						"Text": "The asset path must start with /Game/. Please ensure your input begins with this prefix."
					},
					"Translation":
					{
						"Text": "路径必须以/Game/开头，请确认前缀正确。"
					},
					"Key": "CommonImporter.AssetSavePathPrompt"
				},
				{
					"Source":
					{
						"Text": "The excel file to be loaded is not found. Please input a valid path."
					},
					"Translation":
					{
						"Text": "未找到要加载的Excel文件，请输入有效的路径"
					},
					"Key": "CommonImporter.ExcelPathPrompt"
				},
				{
					"Source":
					{
						"Text": "There is already a file with the same name."
					},
					"Translation":
					{
						"Text": "已经存在同名文件"
					},
					"Key": "CommonImporter.ExistFilePrompt"
				},
				{
					"Source":
					{
						"Text": "There is already a file with the same name.\nDo you want to overwrite it?"
					},
					"Translation":
					{
						"Text": "已经存在同名文件，需要覆盖吗？"
					},
					"Key": "CommonImporter.OverwriteFilePrompt"
				},
				{
					"Source":
					{
						"Text": "{0} curves loaded"
					},
					"Translation":
					{
						"Text": "加载了{0}个曲线表"
					},
					"Key": "CommonImporter.LoadSucceedPrompt"
				}
			]
		},
		{
			"Namespace": "Contexts",
			"Children": [
				{
					"Source":
					{
						"Text": "CommonImporter Plugin"
					},
					"Translation":
					{
						"Text": "CommonImporter Plugin"
					},
					"Key": "CommonImporter"
				}
			]
		},
		{
			"Namespace": "FCommonImporterModule",
			"Children": [
				{
					"Source":
					{
						"Text": "Add code to {0} in {1} to override this window's contents"
					},
					"Translation":
					{
						"Text": "Add code to {0} in {1} to override this window's contents"
					},
					"Key": "CommonImporter.WindowWidgetText"
				},
				{
					"Source":
					{
						"Text": "CommonImporter"
					},
					"Translation":
					{
						"Text": "CommonImporter"
					},
					"Key": "CommonImporter.FCommonImporterTabTitle"
				}
			]
		},
		{
			"Namespace": "UICommands",
			"Subnamespaces": [
				{
					"Namespace": "FCommonImporterModule",
					"Children": [
						{
							"Source":
							{
								"Text": "Bring up CommonImporter window"
							},
							"Translation":
							{
								"Text": "Bring up CommonImporter window"
							},
							"Key": "CommonImporter_ToolTip"
						},
						{
							"Source":
							{
								"Text": "CommonImporter"
							},
							"Translation":
							{
								"Text": "CommonImporter"
							},
							"Key": "CommonImporter"
						}
					]
				}
			]
		}
	]
}